***********************************************************************************************************************************
Notes from 11/9

graph = TitanFactory.open('conf/titan-berkeleyje-es.properties')

new File("fileName.csv").splitEachLine(","){fields ->
	println("Processing")
	graph.addVertex("uuid", fields[2], ...)
}

g = graph.traversal()

g.V().has('total_error', '100956.0').next() // Get vertex that has a total error of 100956

g.V(id).values() // Not sure if 'id' was a variable or an actual ID

g.V(*Some vertex*).valueMap() // Returns all labeled values for *Some vertex*, uses Saturn in example

***********************************************************************************************************************************
Copied & Pasted From Titan:db
http://s3.thinkaurelius.com/docs/titan/1.0.0/getting-started.html

gremlin> saturn = g.V().has('name', 'saturn').next()
==>v[256]
gremlin> g.V(saturn).valueMap()
==>[name:[saturn], age:[10000]]
gremlin> g.V(saturn).in('father').in('father').values('name')
==>hercules
gremlin> hercules = g.V(saturn).repeat(__.in('father')).times(2).next()
==>v[1536]

The Gremlin overview presented in this section focused on the Gremlin-Groovy language implementation. Additional JVM language implementations of Gremlin are available.
https://github.com/tinkerpop/gremlin/wiki/JVM-Language-Implementations

***********************************************************************************************************************************
"25+ Handy Gremlin Examples and Code Snippets for Graph Database Traversal and Manipulation"
http://www.fromdev.com/2013/09/Gremlin-Example-Query-Snippets-Graph-DB.html

Get The Count Of Vertices With A Attribute Value
g.V('firsName','John').count();

***********************************************************************************************************************************
From wikipedia: Lots of examples!
Like Declarative Pattern Matching Traversals vs. OLAP Traversal
https://en.wikipedia.org/wiki/Gremlin_(programming_language)#Traversal_Examples

gremlin> g.V().label().groupCount()		// For each vertex in the graph, emit its label, then group and count each distinct label.
==>[occupation:21, movie:3883, category:18, user:6040]

gremlin> g.V().hasLabel('movie').values('year').min()		//What year was the oldest movie made?
==>1919

gremlin> g.V().has('movie','name','Die Hard').inE('rated').values('stars').mean()		// What is Die Hard's average rating?
==>4.121848739495798

***********************************************************************************************************************************
Notes from lecture:
http://www.slideshare.net/calebwjones/intro-to-graph-databases-using-tinkerpops-titandb-and-gremlin
Suggests Gephi for visualization tool.

Where g is graph traversal.
g.V() // All verticies
g.v() // This verticie (Same with edges)
g.V("thisType", "matchThis")

Where g is a graph factory.
@28:40
g.V.count()
g.E.count()

***********************************************************************************************************************************

Gephi Example
https://www.youtube.com/watch?v=wtiUjna9IMo

***********************************************************************************************************************************

11/16
To run script in Gremlin:
:load /home/casal033/MAP/graph-DBs-and-genetic-programming/gremlin_scripts/LoadNodes.groovy

gremlin> g.V(402206864).valueMap()
==>[generation:[191], total_error:[3554.0], numSelections:[0], numChildren:[0], run_uuid:[884ccc2a-85ec-43d6-b61d-03a33f9e4827], location:[999], uuid:[8536374f-c5b9-46fc-901e-f9d72d9214e5]]

gremlin> g.V().has('total_error', 0.toFloat()).next()
==>v[78712864]
gremlin> g.V().has('total_error', 0f).next()
==>v[78712864]

***********************************************************************************************************************************

11/23
* We're currently deleting the database directory to delete graphs *
Gremlin remove all Vertex:
graph.close()
com.thinkaurelius.titan.core.util.TitanCleanup.clear(graph);

* Ended: Looking at elesticseach for external index based searching *
Install on Bebop next time!

* Not attempted yet *
Adding Edges:
http://gremlindocs.spmallette.documentup.com/#graphaddedge
gremlin> g = new TinkerGraph()
==>tinkergraph[vertices:0 edges:0]
gremlin> v1 = g.addVertex(100)
==>v[100]
gremlin> v2 = g.addVertex(200)
==>v[200]
gremlin> g.addEdge(v1,v2,'friend')
==>e[0][100-friend->200]
gremlin> g.addEdge(1000,v1,v2,'buddy')
==>e[1000][100-buddy->200]
gremlin> g.addEdge(null,v1,v2,'pal',[weight:0.75f])
==>e[1][100-pal->200]

***********************************************************************************************************************************

11/30
* When running gremlin script, if graph directory exists and do not have the write permissions, bad error message occurs

* Close graph and mgmt after running script, otherwise badness and exceptions

* We think the default schema is being used for indexing, and we do not know what type of data it's saved as. We want to set this ourselves.
** we do not want to use the default schema **

*** Should we index before loading everything in?

Login as Maggie
Run gremlin on bebop in directory that has scripts
Remove graphes and searchindex before running script
Use :load LoadNodes.groovy in gremlin
